In [30]:
import numpy as np
import pandas as pd

LAMBDA_A = 1.54178
LAMBDA_B = 1.39217
A = 5.4307

In [31]:
data = pd.read_csv('lab_4.csv', delimiter=';')
data

   N       L
0  1   19.56
1  2   21.84
2  3   51.22
3  4   57.57
4  5   69.93
5  6   80.09
6  7   99.31
7  8  119.20

In [32]:
data['theta'] = data['L'] / 1.5
data

   N       L      theta
0  1   19.56  13.040000
1  2   21.84  14.560000
2  3   51.22  34.146667
3  4   57.57  38.380000
4  5   69.93  46.620000
5  6   80.09  53.393333
6  7   99.31  66.206667
7  8  119.20  79.466667

In [33]:
data['sintheta'] = np.sin(data['theta'] * np.pi / 180)
data

   N       L      theta  sintheta
0  1   19.56  13.040000  0.225631
1  2   21.84  14.560000  0.251394
2  3   51.22  34.146667  0.561313
3  4   57.57  38.380000  0.620874
4  5   69.93  46.620000  0.726814
5  6   80.09  53.393333  0.802748
6  7   99.31  66.206667  0.915007
7  8  119.20  79.466667  0.983149

In [34]:
data['sinthetab'] = data['sintheta'] / 1.1075
data

   N       L      theta  sintheta  sinthetab
0  1   19.56  13.040000  0.225631   0.203730
1  2   21.84  14.560000  0.251394   0.226992
2  3   51.22  34.146667  0.561313   0.506829
3  4   57.57  38.380000  0.620874   0.560609
4  5   69.93  46.620000  0.726814   0.656266
5  6   80.09  53.393333  0.802748   0.724829
6  7   99.31  66.206667  0.915007   0.826191
7  8  119.20  79.466667  0.983149   0.887719

In [35]:
data['type'] = data['sintheta'] / 1.1075
data['type'][0] = 'b'
data['type'][1] = 'a'
data['type'][2] = 'b'
data['type'][3] = 'a'
data['type'][4] = 'b'
data['type'][5] = 'a'
data['type'][6] = 'a'
data['type'][7] = 'a'
data

   N       L      theta  sintheta  sinthetab type
0  1   19.56  13.040000  0.225631   0.203730    b
1  2   21.84  14.560000  0.251394   0.226992    a
2  3   51.22  34.146667  0.561313   0.506829    b
3  4   57.57  38.380000  0.620874   0.560609    a
4  5   69.93  46.620000  0.726814   0.656266    b
5  6   80.09  53.393333  0.802748   0.724829    a
6  7   99.31  66.206667  0.915007   0.826191    a
7  8  119.20  79.466667  0.983149   0.887719    a

In [36]:
data['sintheta2'] = data['sintheta'] ** 2
data

   N       L      theta  sintheta  sinthetab type  sintheta2
0  1   19.56  13.040000  0.225631   0.203730    b   0.050909
1  2   21.84  14.560000  0.251394   0.226992    a   0.063199
2  3   51.22  34.146667  0.561313   0.506829    b   0.315073
3  4   57.57  38.380000  0.620874   0.560609    a   0.385485
4  5   69.93  46.620000  0.726814   0.656266    b   0.528259
5  6   80.09  53.393333  0.802748   0.724829    a   0.644405
6  7   99.31  66.206667  0.915007   0.826191    a   0.837237
7  8  119.20  79.466667  0.983149   0.887719    a   0.966581

In [37]:
data['d'] = data['type']
data.loc[data['type'] == 'a', 'd'] = LAMBDA_A / (2 * data.loc[data['type'] == 'a', 'sintheta'])
data.loc[data['type'] == 'b', 'd'] = LAMBDA_B / (2 * data.loc[data['type'] == 'b', 'sintheta'])
data

   N       L      theta  sintheta  sinthetab type  sintheta2         d
0  1   19.56  13.040000  0.225631   0.203730    b   0.050909   3.08506
1  2   21.84  14.560000  0.251394   0.226992    a   0.063199   3.06646
2  3   51.22  34.146667  0.561313   0.506829    b   0.315073    1.2401
3  4   57.57  38.380000  0.620874   0.560609    a   0.385485   1.24162
4  5   69.93  46.620000  0.726814   0.656266    b   0.528259   0.95772
5  6   80.09  53.393333  0.802748   0.724829    a   0.644405  0.960314
6  7   99.31  66.206667  0.915007   0.826191    a   0.837237  0.842497
7  8  119.20  79.466667  0.983149   0.887719    a   0.966581  0.784103

In [38]:
data['hkl2'] = (A / data['d']) ** 2
data

,N,L,theta,sintheta,sinthetab,type,sintheta2,d,hkl2
0,1,19.56,13.040000,0.225631,0.203730,b,0.050909,3.08506,3.09874
1,2,21.84,14.560000,0.251394,0.226992,a,0.063199,3.06646,3.13643
2,3,51.22,34.146667,0.561313,0.506829,b,0.315073,1.2401,19.1778
3,4,57.57,38.380000,0.620874,0.560609,a,0.385485,1.24162,19.1308
4,5,69.93,46.620000,0.726814,0.656266,b,0.528259,0.95772,32.1539
5,6,80.09,53.393333,0.802748,0.724829,a,0.644405,0.960314,31.9805
6,7,99.31,66.206667,0.915007,0.826191,a,0.837237,0.842497,41.5504
7,8,119.20,79.466667,0.983149,0.887719,a,0.966581,0.784103,47.9695

In [39]:
data['hkl'] = data['sintheta'] / 1.1075
data['hkl'][0] = '111'
data['hkl'][1] = '111'
data['hkl'][2] = '331'
data['hkl'][3] = '331'
data['hkl'][4] = '440'
data['hkl'][5] = '440'
data['hkl'][6] = '541'
data['hkl'][7] = '444'
data

,N,L,theta,sintheta,sinthetab,type,sintheta2,d,hkl2,hkl
0,1,19.56,13.040000,0.225631,0.203730,b,0.050909,3.08506,3.09874,111.0
1,2,21.84,14.560000,0.251394,0.226992,a,0.063199,3.06646,3.13643,111.0
2,3,51.22,34.146667,0.561313,0.506829,b,0.315073,1.2401,19.1778,331.0
3,4,57.57,38.380000,0.620874,0.560609,a,0.385485,1.24162,19.1308,331.0
4,5,69.93,46.620000,0.726814,0.656266,b,0.528259,0.95772,32.1539,440.0
5,6,80.09,53.393333,0.802748,0.724829,a,0.644405,0.960314,31.9805,440.0
6,7,99.31,66.206667,0.915007,0.826191,a,0.837237,0.842497,41.5504,541.0
7,8,119.20,79.466667,0.983149,0.887719,a,0.966581,0.784103,47.9695,444.0

In [40]:
LAMBDA_A * np.sqrt(1 + (86 / 37.8) ** 2)

3.8316340846031713

Направление по всей видимости \[110\]